RedditOnRails/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "IL-SnyRgXzslp8krSde0ew"], ["updated_at", "2018-09-18 20:44:10.385991"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!