RedditOnRails/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
  def new
    @post = Post.new
    @subs = Sub.all

SELECT "subs".* FROM "subs" WHERE 1=0
INSERT INTO "posts" ("title", "content", "author_id", "created_at", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "11"], ["content", "sfg"], ["author_id", 1], ["created_at", "2018-09-18 22:19:43.092073"], ["updated_at", "2018-09-18 22:19:43.092073"], ["url", ""]]
---
  def create
    @subs = Sub.all
    # @post = Post.new(post_params)
    @post = current_user.posts.new(post_params)
    @post.author_id = current_user.id

    # sub_ids = params[:post][:sub_ids][1..-1]
    # # sub_ids = post_params[:sub_ids][1..-1]
    # sub_ids.map! {|id| id.to_i}

    if @post.save

SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subs = Sub.all
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "The TWELVETH "], ["content", "12"], ["updated_at", "2018-09-18 23:22:23.704328"], ["id", 6]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "vote_tally" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["vote_tally", 1], ["updated_at", "2018-09-18 23:41:00.594303"], ["id", 2]]
---
  def upvote
    @post = Post.find(params[:id])
    @post.vote_tally += 1
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "vote_tally" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["vote_tally", 4], ["updated_at", "2018-09-18 23:43:20.103500"], ["id", 2]]
---
  def downvote
    @post = Post.find(params[:id])
    @post.vote_tally -= 1
    @post.save