RedditOnRails/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "created_at", "updated_at", "description", "moderator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "theFourth"], ["created_at", "2018-09-18 21:48:26.429772"], ["updated_at", "2018-09-18 21:48:26.429772"], ["description", "July 4"], ["moderator_id", 1]]