RedditOnRails/app/views/subs/show.html.erb


<% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "sp_interfaces" ON "posts"."id" = "sp_interfaces"."post_id" WHERE "sp_interfaces"."sub_id" = $1  [["sub_id", 2]]